#include "Func.h"
/**
 *Функція відсортовує масив, бульбошковим методом
 * в аргументи приймає посилання на функцію яка створює масив
 * та його розмір
 */
int *sort_arr(int arr[], int len) {
    int temp; // тимчасова змінна
    for (int i = 0; i < len; i++) {
        for (int j = 0; j < len - 1; j++) {
            // умова якщо індекс більш ніж наступний
            if (arr[j] > arr[j + 1]) {
                temp = arr[j]; // присвоюємо тимчасовій змінній
                arr[j] = arr[j + 1]; // присвоюємо наступний індекс в нинішній
                arr[j + 1] = temp; // присвоюємо тимчасову змінну в наступний індекс
            }
        }
    }
    return arr;;
}
